AccumulationRegisters/ЛБ_РасчетыСКлиентами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЛБ_РасчетыСКлиентами</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КоличествоДнейРасчета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыРасчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаНачалаРасчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_СостояниеЗалоговогоБилета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_СостояниеЗалоговогоБилета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПричинаПрименения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ПричиныПримененияПроцентнойСхемы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусЗалоговогоБилета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_СтатусыЗалоговыхБилетов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЗайма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачалаРасчетаПроцентов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерДопСоглашения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыкупа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыкупаЛьготныйСрок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПроцентовДень</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПроцентовСрок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредельныйСрокЗайма</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредельныйСрокЗаймаДни</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОстановкиНачислений</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОплатыБезПродления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Залогодатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерЗалоговогоБилета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СхемаКредитования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_СхемыКредитования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_ДокументыЗалогодателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ДокументыЗалогодателей</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Гражданство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновнойДУЛ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновнойДоп</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументДатаВыдачи</Name>
					<Comment>Дата выдачи документа</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументКемВыдан</Name>
					<Comment>Кем выдан </Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументКодПодразделения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументСерия</Name>
					<Comment>Серия документа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументНомер</Name>
					<Comment>Номер документа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументНачалоДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументСрокДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументНеДействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСмерти</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументДействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументСтранаЭмитент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументНаименованиеИногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПричинаИзменения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ПричиныИзмененияКарточкиЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДокументЗалогодателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ДокументыЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДокументаЗалогодателя</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыДокументовЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументовФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_КлиентыВПеречнях.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_КлиентыВПеречнях</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Залогодатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПроверки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыПроверкиПеречней</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПеречня</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыПеречней</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаПеречня</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаВключенияВПеречень</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодОтказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусКлиентаВПеречне</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_СтатусыКлиентаВПеречнях</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ЛБ_ПричиныПримененияПроцентнойСхемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ПричиныПримененияПроцентнойСхемы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВыдачаЗайма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПроцентов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЛБ_ВидыОперацийДоверенность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыОперацийДоверенность</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Оформление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Наследство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отзыв</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЛБ_СтатусыКлиентаВПеречнях.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_СтатусыКлиентаВПеречнях</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Включен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исключен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonForms/ЛБ_ОтменаПереоформленияЗайма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Документ") Тогда
        ДокументЗайма = Параметры.Документ;  
		ЗалоговыйБилет = ДокументЗайма.ПредыдущаяОперация;
		Если ДокументЗайма.Проведен тогда
			НеРедактировать = Истина;
			Элементы.ДекорацияСтатусДокумента.Заголовок = "Факт"; 
			Элементы.ДекорацияСтатусДокумента.ЦветТекста = WebЦвета.ТемноБордовый;  
			Элементы.ДекорацияСтатусДокумента.ЦветФона = WebЦвета.ТусклоРозовый;
		Иначе
			Элементы.ДекорацияСтатусДокумента.Заголовок = "Проект"; 
			Элементы.ДекорацияСтатусДокумента.ЦветТекста = WebЦвета.ТемноЗеленый;
			Элементы.ДекорацияСтатусДокумента.ЦветФона = WebЦвета.СветлоЗеленый;
		КонецЕсли;	   
		ДатаДок = ДокументЗайма.Дата; 
		Ломбард = ДокументЗайма.Ломбард;  
		ОтветственныйПользователь = ДокументЗайма.ОтветственныйПользователь;
		ОтветственныйСотрудник = ДокументЗайма.ОтветственныйСотрудник;
		Комментарий = ДокументЗайма.Комментарий;   
		ПредыдущаяОперация = ЗалоговыйБилет.ПредыдущаяОперация;
		Залогодатель = ЗалоговыйБилет.Залогодатель; 
		ДокументЗалогодателя = ЗалоговыйБилет.ДокументЗалогодателя;  
		Представитель = ЗалоговыйБилет.Представитель; 
		ДокументПредставителя = ЗалоговыйБилет.ДокументПредставителя; 
		СхемаКредитования = ЗалоговыйБилет.СхемаКредитования;
		СрокЗалога = ЗалоговыйБилет.СрокЗалога;
		ОтказОтВыкупа = ЗалоговыйБилет.ОтказОтВыкупа;        
		СуммаЗайма = ЗалоговыйБилет.СуммаСсуды;
		НомерЗБ = ЗалоговыйБилет.НомерЗалоговогоБилета;
		ДопДокументы.Загрузить(ЗалоговыйБилет.ДополнительныеДокументыПравоПребыванияРФ.Выгрузить()); 
		ЗаполнитьКонтакнуюИнформациюЗалогодателя(); 
		ЗаполнитьИнформациюОДокументеЗалогодателя();
		Если ЗначениеЗаполнено(Представитель) тогда
		    ЗаполнитьКонтакнуюИнформациюПредставителя(); 
			ЗаполнитьИнформациюОДокументеПредставителя();
		КонецЕсли;  
		ДоверенностьПереоформление = ЗалоговыйБилет.ДоверенностьПредставителя;
		СтатусЗалогодателя = ЗалоговыйБилет.СтатусЗалогодателя; 
		ЗаполнитьСостояниеЗалоговогоБилетаПереоформление();
		ЗаполнитьСостояниеЗалоговогоБилета();
		Если ЗначениеЗаполнено(Представитель) Тогда
			Плательщик = Представитель;
		Иначе	
		    Плательщик = Залогодатель;
		КонецЕсли;	
		Если НЕ Плательщик = ПредыдущаяОперация.Залогодатель Тогда			
			Элементы.ГруппаДоверенность.Видимость = Истина; 
			ЗаполнитьТекстДоверенности();
		КонецЕсли;	  
		ЗаполнитьТовары();
		Элементы.ОсновнаяПанель.ТекущаяСтраница = Элементы.СтраницаОбъектыЗалога; 
		//+Мельников 25.04.24 Отмена операции
		ОтмененныйДокумент = ДокументЗайма.ОтмененныйДокумент;
		Элементы.ВидОтменненойОперации.Заголовок = "Отмененная операция: " + """" + ДокументЗайма.ОтмененныйДокумент.ВидОперации + """";
		//-Мельников  
		Если Параметры.ТолькоПросмотр = Истина Тогда	
			Этаформа.ТолькоПросмотр = Истина;
		КонецЕсли;
	Иначе		
		ДатаДок = ТекущаяДата();   
		ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
		//Если НЕ ТекПользователь.ЭтоЛомбард Тогда
		//  	ОтветственныйПользователь = ТекПользователь;
		//Иначе
		//	ОтветственныйПользователь = ПараметрыСеанса.ТекущийСотрудник;
		//КонецЕсли;   
		ОтветственныйПользователь = ПараметрыСеанса.ТекущийПользователь;
        ОтветственныйСотрудник = ПараметрыСеанса.ТекущийСотрудник; 		
		Ломбард = ЛБ_УправлениеЛомбардом.ПолучитьОсновнойЛомбардПользователя();		
		Если Параметры.Свойство("ЗалоговыйБилет") Тогда  
			ЗалоговыйБилет = Параметры.ЗалоговыйБилет;
			Залогодатель = ЗалоговыйБилет.Залогодатель; 
			ДокументЗалогодателя = ЗалоговыйБилет.ДокументЗалогодателя;
			Представитель = ЗалоговыйБилет.Представитель; 
		    ДокументПредставителя = ЗалоговыйБилет.ДокументПредставителя; 
            ПредыдущаяОперация = ЗалоговыйБилет.ПредыдущаяОперация;   
			НомерЗБ = ЗалоговыйБилет.НомерЗалоговогоБилета;
			СхемаКредитования = ЗалоговыйБилет.СхемаКредитования;
			СрокЗалога = ЗалоговыйБилет.СрокЗалога;
			ОтказОтВыкупа = ЗалоговыйБилет.ОтказОтВыкупа;  
			ДопДокументы.Загрузить(ЗалоговыйБилет.ДополнительныеДокументыПравоПребыванияРФ.Выгрузить()); 
		    ЗаполнитьКонтакнуюИнформациюЗалогодателя();
		   	ЗаполнитьИнформациюОДокументеЗалогодателя();
			Если ЗначениеЗаполнено(Представитель) тогда
			    ЗаполнитьКонтакнуюИнформациюПредставителя(); 
				ЗаполнитьИнформациюОДокументеПредставителя();
			КонецЕсли;  
			ДоверенностьПереоформление = ЗалоговыйБилет.ДоверенностьПредставителя;
			СтатусЗалогодателя = ЗалоговыйБилет.СтатусЗалогодателя; 
			ЗаполнитьСостояниеЗалоговогоБилетаПереоформление();
			ЗаполнитьСостояниеЗалоговогоБилета();
			Если ЗначениеЗаполнено(Представитель) Тогда
				Плательщик = Представитель;
			Иначе	
			    Плательщик = Залогодатель;
			КонецЕсли;	
			Если НЕ Плательщик = ПредыдущаяОперация.Залогодатель Тогда			
				Элементы.ГруппаДоверенность.Видимость = Истина; 
				ЗаполнитьТекстДоверенности();
			КонецЕсли;	  
			ЗаполнитьТовары();  
			Элементы.ОсновнаяПанель.ТекущаяСтраница = Элементы.СтраницаЗаемщик;  
			  
		КонецЕсли;  
	КонецЕсли;  
	ПричинаПримененияПроцентнойСхемы = Перечисления.ЛБ_ПричиныПримененияПроцентнойСхемы.ВыдачаЗайма;
	                              
	ТоварыИтоги();	
	Элементы.ДекорацияЗБПереоформление.Заголовок = "Залоговый билет № " + сокрЛП(ЭтаФорма.ПредыдущаяОперация.НомерЗалоговогоБилета) +
	           " от " + Формат(ЭтаФорма.ПредыдущаяОперация.Дата, "ДЛФ=") +
	           ", заемщик " + СокрЛП(ЭтаФорма.ПредыдущаяОперация.Фамилия) + " " + СокрЛП(ЭтаФорма.ПредыдущаяОперация.Имя) + 
	           ?(ЗначениеЗаполнено(ЭтаФорма.ПредыдущаяОперация.Отчество), " " + СокрЛП(ЭтаФорма.ПредыдущаяОперация.Отчество), "") + 
	           ", " + СокрЛП(ЭтаФорма.ПредыдущаяОперация.СхемаКредитования) + " на " + СокрЛП(ЭтаФорма.ПредыдущаяОперация.СрокЗалога) + " дней, " + 
			   ?(ЗначениеЗаполнено(ЭтаФорма.ПредыдущаяОперация.Ломбард.НомерЛомбарда), "ломбард № " + СокрЛП(ЭтаФорма.ПредыдущаяОперация.Ломбард.НомерЛомбарда), СокрЛП(ЭтаФорма.ПредыдущаяОперация.Ломбард));   
			   
	Элементы.ДекорацияЗБ.Заголовок = "Залоговый билет № " + сокрЛП(ЭтаФорма.ЗалоговыйБилет.НомерЗалоговогоБилета) +
	           " от " + Формат(ЭтаФорма.ЗалоговыйБилет.Дата, "ДЛФ=") +
	           ", заемщик " + СокрЛП(ЭтаФорма.ФИО) + ", " + СокрЛП(ЭтаФорма.ЗалоговыйБилет.СхемаКредитования) + " на " + СокрЛП(ЭтаФорма.ЗалоговыйБилет.СрокЗалога) + " дней, " + 
			   ?(ЗначениеЗаполнено(ЭтаФорма.ЗалоговыйБилет.Ломбард.НомерЛомбарда), "ломбард № " + СокрЛП(ЭтаФорма.ЗалоговыйБилет.Ломбард.НомерЛомбарда), СокрЛП(ЭтаФорма.ЗалоговыйБилет.Ломбард)); 
			      
    СообщениеПроверкиПоЛомбарду = ЛБ_УправлениеЛомбардом.ПроверитьИзделияЗБВЛомбарде(ЗалоговыйБилет.Дата-1, ПредыдущаяОперация, Ломбард, ложь); 
	Если НЕ ПустаяСтрока(СообщениеПроверкиПоЛомбарду) Тогда 
		ОбщегоНазначения.СообщитьПользователю(СообщениеПроверкиПоЛомбарду+ ". Отмена переоформления запрещена.");
	КонецЕсли;
	//+Мельников 28.05.24
	УстановитьВидимость()
	//-Мельников
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТекстДоверенности()   
	Если ЗначениеЗаполнено(ДоверенностьПереоформление) Тогда  
		Если ДоверенностьПереоформление.ВидОперации = Перечисления.ЛБ_ВидыОперацийДоверенность.Наследство Тогда   
			Доверенность = "Свидетельство о праве на наследство № " + СокрЛП(ДоверенностьПереоформление.НомерДоверенности) + " от " + Формат(ДоверенностьПереоформление.ДатаДоверенности, "ДФ=dd.MM.yyyy"); 
		Иначе	
		    Доверенность = "Доверенность " + НРег(строка(ДоверенностьПереоформление.ВидДоверенности)) + " № " +                                                                                               		
				   ?(НЕ ПустаяСтрока(ДоверенностьПереоформление.НомерДоверенности), СокрЛП(ДоверенностьПереоформление.НомерДоверенности), "б/н") + " от " + Формат(ДоверенностьПереоформление.ДатаДоверенности, "ДФ=dd.MM.yyyy") +
				   " действует до " + Формат(ДоверенностьПереоформление.СрокДействияДоверенности, "ДФ=dd.MM.yyyy"); 
		КонецЕсли;		   
	Иначе
		Доверенность = "";
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТовары() 	
	ТаблицаТоваров.Очистить(); 
	Ном = 0;
	Для каждого стр Из ЗалоговыйБилет.Товары Цикл
		//+Мельников 28.05.24 Закомментировал. При отмене операции должны отменяться все операции по документу.
		//Если НЕ Стр.Переоформить Тогда
		//	Продолжить;
		//КонецЕсли;
		//-Мельников
		Ном = Ном + 1;
		НоваяСтр = ТаблицаТоваров.Добавить(); 
		НоваяСтр.Номерстроки = Стр.Номерстроки;
		//НоваяСтр.Артикул = ?(НЕ Стр.Переоформить, ЛБ_УправлениеЛомбардом.АртикулОбъектаЗалога(ЗалоговыйБилет.ПредыдущаяОперация, стр.ОбъектЗалога), ЛБ_УправлениеЛомбардом.АртикулОбъектаЗалога(ЗалоговыйБилет, стр.ОбъектЗалога));
		НоваяСтр.Артикул = ЛБ_УправлениеЛомбардом.АртикулОбъектаЗалога(ЗалоговыйБилет, Ном);
		НоваяСтр.ОбъектЗалога = стр.ОбъектЗалога;  
		НоваяСтр.ОбъектЗалогаСтрока = Строка(стр.ОбъектЗалога) + ?(Стр.Переоформить, "", " (добавлен)");
		НоваяСтр.СтатусОбъекта = ?(Стр.Переоформить, ЛБ_УправлениеЛомбардом.ПолучитьСостояниеОбъектаЗалога(ДатаДок-1, НоваяСтр.ОбъектЗалога, ЗалоговыйБилет), Перечисления.ЛБ_СтатусыОбъектовЗалога.Выкуплен); 
		//НоваяСтр.СтатусОбъектаПослеОтмены = ?(Стр.Новый, Перечисления.ЛБ_СтатусыОбъектовЗалога.ОтказОтОформления, ЛБ_УправлениеЛомбардом.ПолучитьСостояниеОбъектаЗалога(ЗалоговыйБилет.Дата-1, НоваяСтр.ОбъектЗалога, ПредыдущаяОперация));
		НоваяСтр.СтатусОбъектаПослеОтмены = Перечисления.ЛБ_СтатусыОбъектовЗалога.ОтказОтОформления;
		НоваяСтр.СуммаСсуды = стр.СуммаСсуды;
		НоваяСтр.СуммаОценки = стр.СуммаОценкиМаксимальная; 	 
	Конеццикла;		
	ТоварыИтогОценка = ТаблицаТоваров.Итог("СуммаОценки");
	ТоварыИтогЗайи = ТаблицаТоваров.Итог("СуммаСсуды");
КонецПроцедуры	

&НаСервере
Функция СоздатьНовуюОплатуПроцентов()
	ДокументОбъект = Документы.ЛБ_ОперацияПоЗалогу.СоздатьДокумент(); 
	ДокументОбъект.ПредыдущаяОперация = ПредыдущаяОперация; 
	ДокументОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОплатаПроцентов;
	ДокументОбъект.Дата = ?(ЗначениеЗаполнено(ЭтаФорма.ДокументЗайма), ДатаДок-1, ДатаДок); 
	ДокументОбъект.Организация = Константы.ЛБ_ОсновнаяОрганизация.Получить();
	ДокументОбъект.ПроцентнаяСхема = ПредыдущаяОперация.ПроцентнаяСхема;  
	ДокументОбъект.Выкуп = Истина;
	Возврат ДокументОбъект; 
КонецФункции

&НаСервере
Функция РасчитатьДолгПоПроцентам(ЗБ, СтатусЗБ, СуммаЗайма, ПроцентнаяСтавка, ДатаНачалаРасчета) 
	//ТаблицаОплатДетально.Очистить();
	ДокументОбъект = СоздатьНовуюОплатуПроцентов(); 	    
	СтруктураП = ЛБ_УправлениеЛомбардом.ПолучитьПредельныеЗначенияПроцентов(ЗБ.Дата, ЗБ.Организация);
	Если НЕ СтруктураП = неопределено Тогда
	    ПланкаПроцентов = СтруктураП.ПланкаПроцентов;
		ПредельноеЗначениеПроцентов = ЗБ.СуммаСсуды*СтруктураП.ПланкаПроцентов; 
	Иначе
		ПредельноеЗначениеПроцентов = 0;
	КонецЕсли;   
	СтруктураОкр = ЛБ_УправлениеЛомбардом.ПолучитьУсловияОкругленияПроцентов(ЗБ);
	Установки = ЛБ_УправлениеЛомбардом.ПолучитьУсловияПоДоговору(ЗБ); 	   
	ПричинаПримененияПроцентнойСхемыОплата = Перечисления.ЛБ_ПричиныПримененияПроцентнойСхемы.ОплатаПроцентов;
	Результат = ЛБ_ОбщийМодуль.РассчитатьСуммуПроцентовОплата(ДокументОбъект, ДатаНачалаРасчета, ПредельноеЗначениеПроцентов, ПричинаПримененияПроцентнойСхемыОплата, Установки, СтруктураОкр); 
			
	//Для каждого стр из ДокументОбъект.НачислениеПроцентовДетально Цикл 
	//    НоваяСтр = ТаблицаОплатДетально.Добавить(); 
	//	ЗаполнитьЗначенияСвойств(НоваяСтр, стр);
	//КонецЦиклА;
	//
	//НачисленоПроцентов = Результат.СуммаПроцентовНачислено;
	//
	Возврат Результат.СуммаПроцентов;
КонецФункции	

&НаСервере
Процедура ЗаполнитьСостояниеЗалоговогоБилетаПереоформление()  
	Запрос = новый Запрос;
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ПредыдущаяОперация); 
	Если ЗначениеЗаполнено(ЭтаФорма.ДокументЗайма) Тогда
		Запрос.УстановитьПараметр("Период", ДатаДок-1); 
	Иначе	
	    Запрос.УстановитьПараметр("Период", ДатаДок);  		
	КонецЕсли;	                                       
	                                     
	ЗапросРасчеты = Новый Запрос;   
	ЗапросРасчеты.УстановитьПараметр("ЗалоговыйБилет", ПредыдущаяОперация);
	ЗапросРасчеты.Текст = "ВЫБРАТЬ
	                      |	СУММА(ЛБ_РасчетыСКлиентами.Сумма) КАК Сумма
	                      |ИЗ
	                      |	РегистрНакопления.ЛБ_РасчетыСКлиентами КАК ЛБ_РасчетыСКлиентами
	                      |ГДЕ
	                      |	ЛБ_РасчетыСКлиентами.Регистратор = &Регистратор
	                      |	И ЛБ_РасчетыСКлиентами.ЗалоговыйБилет = &ЗалоговыйБилет
	                      |	И ЛБ_РасчетыСКлиентами.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)";
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СостояниеЗалоговогоБилета.Регистратор КАК Регистратор,
	               |	ЛБ_СостояниеЗалоговогоБилета.СуммаЗайма КАК СуммаЗайма,
	               |	ЛБ_СостояниеЗалоговогоБилета.ДатаВыкупа КАК ДатаВыкупа,
	               |	ЛБ_СостояниеЗалоговогоБилета.ДатаВыкупаЛьготныйСрок КАК ДатаВыкупаЛьготныйСрок,
	               |	ЛБ_СостояниеЗалоговогоБилета.СтатусЗалоговогоБилета КАК СтатусЗалоговогоБилета,
	               |	ЛБ_СостояниеЗалоговогоБилета.ДатаНачалаРасчетаПроцентов КАК ДатаНачалаРасчетаПроцентов,
	               |	ЛБ_СостояниеЗалоговогоБилета.СуммаПроцентовДень КАК СуммаПроцентовДень,
	               |	ЛБ_СостояниеЗалоговогоБилета.СуммаПроцентовСрок КАК СуммаПроцентовСрок,
	               |	ЛБ_СостояниеЗалоговогоБилета.ПредельныйСрокЗайма КАК ПредельныйСрокЗайма,
	               |	ЛБ_СостояниеЗалоговогоБилета.ПредельныйСрокЗаймаДни КАК ПредельныйСрокЗаймаДни,
	               |	ЛБ_СостояниеЗалоговогоБилета.НомерДопСоглашения КАК НомерДопСоглашения
	               |ИЗ
	               |	РегистрСведений.ЛБ_СостояниеЗалоговогоБилета КАК ЛБ_СостояниеЗалоговогоБилета
	               |ГДЕ
	               |	ЛБ_СостояниеЗалоговогоБилета.ЗалоговыйБилет = &ЗалоговыйБилет
	               |	И ЛБ_СостояниеЗалоговогоБилета.Период <= &Период
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛБ_СостояниеЗалоговогоБилета.Период";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить(); 
	ТаблицаСостоянийПереоформление.Очистить();
	Если ТаблицаЗапроса.Количество() > 0 Тогда
		СтрСостояние = ТаблицаЗапроса.Получить(0);
		НоваяСтр = ТаблицаСостоянийПереоформление.Добавить();
		НоваяСтр.Состояние = "Начальные условия займа";
		НоваяСтр.КлючСтроки = 1;
		НоваяСтр.Статус = СтрСостояние.СтатусЗалоговогоБилета;
		НоваяСтр.СуммаЗайма = СтрСостояние.СуммаЗайма;
		НоваяСтр.ДатаВозврата = СтрСостояние.ДатаВыкупа;
		НоваяСтр.ДатаВозвратаЛьготная = СтрСостояние.ДатаВыкупаЛьготныйСрок; 
		НоваяСтр.ДатаНачалаРасчета = СтрСостояние.ДатаНачалаРасчетаПроцентов;
		НоваяСтр.ПроцентнаяСтавка = ПредыдущаяОперация.ПроцентнаяСхема;
		НоваяСтр.СуммаПроцентовДень = СтрСостояние.СуммаПроцентовДень;
		НоваяСтр.СуммаПроцентовСрок = СтрСостояние.СуммаПроцентовСрок;
		НоваяСтр.ПредельныйСрокЗайма = СтрСостояние.ПредельныйСрокЗайма;
		НоваяСтр.ПредельныйСрокЗаймаДни = СтрСостояние.ПредельныйСрокЗаймаДни;  
		//НоваяСтр.СуммаИтог = СтрСостояние.СуммаЗайма; 
				
		КолСтр = ТаблицаЗапроса.Количество()-1;  		
		СтрСостояние = ТаблицаЗапроса.Получить(КолСтр);   
		Если ТипЗнч(СтрСостояние.Регистратор) = Тип("ДокументСсылка.ЛБ_КарточкаЗалогодателя") Тогда
			ТекущийСтатусЗБ = СтрСостояние.СтатусЗалоговогоБилета; 
			СтрСостояние = ТаблицаЗапроса.Получить(КолСтр-1); 
		Иначе
			ТекущийСтатусЗБ = неопределено;
		КонецЕсли;	
		НоваяСтр = ТаблицаСостоянийПереоформление.Добавить();
		НоваяСтр.Состояние = "Состояние залогового билета до отмены переоформления";
		НоваяСтр.КлючСтроки = 2;
		НоваяСтр.Статус = ?(ТекущийСтатусЗБ = неопределено, СтрСостояние.СтатусЗалоговогоБилета, ТекущийСтатусЗБ);    
		ЗапросРасчеты.УстановитьПараметр("Регистратор", СтрСостояние.Регистратор); 
		ВыборкаР = ЗапросРасчеты.Выполнить().Выбрать();
		Если ВыборкаР.Следующий() Тогда
		    НоваяСтр.СуммаИтог = ВыборкаР.Сумма; 
		КонецЕсли;
		
		Если ТаблицаЗапроса.Количество() = 1 Тогда  
			СтрСостояние = ТаблицаЗапроса.Получить(0);
		Иначе  
			КолСтр = ТаблицаЗапроса.Количество()-2;  		
		    СтрСостояние = ТаблицаЗапроса.Получить(КолСтр);   
		КонецЕсли;	  
		Если ТипЗнч(СтрСостояние.Регистратор) = Тип("ДокументСсылка.ЛБ_КарточкаЗалогодателя") Тогда
			ТекущийСтатусЗБ = СтрСостояние.СтатусЗалоговогоБилета; 
			СтрСостояние = ТаблицаЗапроса.Получить(КолСтр-1); 
		Иначе
			ТекущийСтатусЗБ = неопределено;
		КонецЕсли;	
		НоваяСтр = ТаблицаСостоянийПереоформление.Добавить();
		НоваяСтр.Состояние = "Состояние залогового билета после отмены переоформления";
		НоваяСтр.КлючСтроки = 3;
		НоваяСтр.Статус = ?(ТекущийСтатусЗБ = неопределено, СтрСостояние.СтатусЗалоговогоБилета, ТекущийСтатусЗБ);    
        НоваяСтр.СуммаЗайма = СтрСостояние.СуммаЗайма;
		НоваяСтр.ДатаВозврата = СтрСостояние.ДатаВыкупа;
		НоваяСтр.ДатаВозвратаЛьготная = СтрСостояние.ДатаВыкупаЛьготныйСрок; 
		НоваяСтр.ДатаНачалаРасчета = СтрСостояние.ДатаНачалаРасчетаПроцентов;
		НоваяСтр.ПроцентнаяСтавка = ПредыдущаяОперация.ПроцентнаяСхема;
		НоваяСтр.СуммаПроцентовДень = СтрСостояние.СуммаПроцентовДень;
		НоваяСтр.СуммаПроцентовСрок = СтрСостояние.СуммаПроцентовСрок;
		НоваяСтр.ПредельныйСрокЗайма = СтрСостояние.ПредельныйСрокЗайма;
		НоваяСтр.ПредельныйСрокЗаймаДни = СтрСостояние.ПредельныйСрокЗаймаДни; 
		НоваяСтр.СуммаПроцентовДолг = РасчитатьДолгПоПроцентам(ПредыдущаяОперация, НоваяСтр.Статус, НоваяСтр.СуммаЗайма, НоваяСтр.ПроцентнаяСтавка, НоваяСтр.ДатаНачалаРасчета);
	 Иначе
		НоваяСтр = ТаблицаСостоянийПереоформление.Добавить();
		НоваяСтр.Состояние = "Начальные условия займа";
		НоваяСтр.КлючСтроки = 1;
	КонецЕсли;	  
	
КонецПроцедуры  

&НаСервере
Процедура ЗаполнитьСостояниеЗалоговогоБилета() 
	Запрос = новый Запрос;
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет); 
	Если ЗначениеЗаполнено(ДокументЗайма) Тогда
		Запрос.УстановитьПараметр("Период", ДатаДок-1); 
	Иначе	
	    Запрос.УстановитьПараметр("Период", ДатаДок); 
	КонецЕсли;	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СостояниеЗалоговогоБилета.Регистратор КАК Регистратор,
	               |	ЛБ_СостояниеЗалоговогоБилета.СуммаЗайма КАК СуммаЗайма,
	               |	ЛБ_СостояниеЗалоговогоБилета.ДатаВыкупа КАК ДатаВыкупа,
	               |	ЛБ_СостояниеЗалоговогоБилета.ДатаВыкупаЛьготныйСрок КАК ДатаВыкупаЛьготныйСрок,
	               |	ЛБ_СостояниеЗалоговогоБилета.СтатусЗалоговогоБилета КАК СтатусЗалоговогоБилета,
	               |	ЛБ_СостояниеЗалоговогоБилета.ДатаНачалаРасчетаПроцентов КАК ДатаНачалаРасчетаПроцентов,
	               |	ЛБ_СостояниеЗалоговогоБилета.СуммаПроцентовДень КАК СуммаПроцентовДень,
	               |	ЛБ_СостояниеЗалоговогоБилета.СуммаПроцентовСрок КАК СуммаПроцентовСрок
	               |ИЗ
	               |	РегистрСведений.ЛБ_СостояниеЗалоговогоБилета КАК ЛБ_СостояниеЗалоговогоБилета
	               |ГДЕ
	               |	ЛБ_СостояниеЗалоговогоБилета.ЗалоговыйБилет = &ЗалоговыйБилет
	               |	И ЛБ_СостояниеЗалоговогоБилета.Период <= &Период
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛБ_СостояниеЗалоговогоБилета.Период";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить(); 
	ТаблицаСостояний.Очистить();
	Если ТаблицаЗапроса.Количество() > 0 Тогда
		СтрСостояние = ТаблицаЗапроса.Получить(0);
		НоваяСтр = ТаблицаСостояний.Добавить();
		НоваяСтр.Состояние = "Начальные условия переоформления займа";
		НоваяСтр.КлючСтроки = 1;
		НоваяСтр.Статус = СтрСостояние.СтатусЗалоговогоБилета;
		НоваяСтр.СуммаЗайма = СтрСостояние.СуммаЗайма;
		НоваяСтр.ДатаВозврата = СтрСостояние.ДатаВыкупа;
		НоваяСтр.ДатаВозвратаЛьготная = СтрСостояние.ДатаВыкупаЛьготныйСрок; 
		НоваяСтр.ДатаНачалаРасчета = СтрСостояние.ДатаНачалаРасчетаПроцентов;
		НоваяСтр.ПроцентнаяСтавка = ЗалоговыйБилет.ПроцентнаяСхема;
		НоваяСтр.СуммаПроцентовДень = СтрСостояние.СуммаПроцентовДень;
		НоваяСтр.СуммаПроцентовСрок = СтрСостояние.СуммаПроцентовСрок;
				
		НоваяСтр = ТаблицаСостояний.Добавить();
		НоваяСтр.Состояние = "Состояние залогового билета после отмены переоформления займа";
		НоваяСтр.КлючСтроки = 3;  	                                          
		НоваяСтр.Статус = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.ОтказОтОформления;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПолучитьНомераЗБ() 
	ИнфНомераЗБ = "";  
	ТоварыДоп = ТаблицаТоваров.Выгрузить();
	ТоварыДоп.Свернуть("НомерЗалоговогоБилета");
	Для каждого СтрДоп из ТоварыДоп Цикл 
		ИнфНомераЗБ = ИнфНомераЗБ + ?(Пустаястрока(ИнфНомераЗБ), "", ", ") + СокрЛП(стрДоп.НомерЗалоговогоБилета);
	Конеццикла;	  
	ИнфНомераЗБ = ИнфНомераЗБ + " от " + Формат(ДатаДок, "ДЛФ=DDT");
	Возврат ИнфНомераЗБ; 
КонецФункции	          

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если НЕ ДопДокументы.Количество() = 0 Тогда
		Элементы.ГруппаДопДокумент.Показать(); 
	КонецЕсли;	 
	
	Если НЕ ЗначениеЗаполнено(Этаформа.ДоверенностьПереоформление) Тогда
		Элементы.ГруппаДоверенность.Видимость = Ложь; 
	КонецЕсли;	
	
	Если НеРедактировать Тогда  
		Элементы.Редактировать.Видимость = ?(ЭтаФорма.ТолькоПросмотр, Ложь, Истина);
		Элементы.ОтменитьЗайм.Доступность = ложь;
	    Элементы.ОсновнаяПанель.ТолькоПросмотр = Истина; 
	Иначе
		Элементы.СтраницаЗаемщик.ТолькоПросмотр = Истина;  
	КонецЕсли;	
		
	ПриСменеСтраницы(Элементы.ОсновнаяПанель.ТекущаяСтраница); 
КонецПроцедуры   

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
КонецПроцедуры  

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	//+Мельников 31.07.24
	Если ЗначениеЗаполнено(ДокументОтмены) Тогда
		СтруктураВозврата = Новый Структура;
		СтруктураВозврата.Вставить("ОтмененныйДокумент", ЗалоговыйБилет);
		СтруктураВозврата.Вставить("ДокументОтмены", ДокументОтмены);
		
		ЭтаФорма.Закрыть(СтруктураВозврата);
	Иначе
		ЭтаФорма.Закрыть(Неопределено);
	КонецЕсли;
	//-Мельников
КонецПроцедуры

&НаСервере
Процедура ТоварыИтоги()   
	ТоварыИтогОценка = ТаблицаТоваров.Итог("СуммаОценки");
   	ТоварыИтогСсуда = ТаблицаТоваров.Итог("СуммаСсуды");
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьИнфорациюОЗалогодателе(Параметры)
	Если Параметры.Свойство("ДокументЗалогодателя") Тогда
		ДокументЗалогодателя = Параметры.ДокументЗалогодателя; 
		ЗаполнитьИнформациюОДокументеЗалогодателя();
	КонецЕсли;	
	ЗаполнитьКонтакнуюИнформациюЗалогодателя();
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьИнформациюОДокументеЗалогодателя()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ЗалоговыйБилет.Дата);
	Запрос.УстановитьПараметр("ДокументЗалогодателя", ДокументЗалогодателя);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокументаЗалогодателя КАК ВидДокументаЗалогодателя,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокумента КАК ВидДокумента,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСерия КАК ДокументСерия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНомер КАК ДокументНомер,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументДатаВыдачи КАК ДокументДатаВыдачи,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКемВыдан КАК ДокументКемВыдан,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКодПодразделения КАК ДокументКодПодразделения,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНачалоДействия КАК ДокументНачалоДействия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСрокДействия КАК ДокументСрокДействия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.Гражданство КАК Гражданство
	               |ИЗ
	               |	РегистрСведений.ЛБ_ДокументыЗалогодателей.СрезПоследних(&Дата, ДокументЗалогодателя = &ДокументЗалогодателя) КАК ЛБ_ДокументыЗалогодателейСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Информация = "";
		Информация = СокрЛП(Выборка.ВидДокумента);
		Информация = Информация + ?(ЗначениеЗаполнено(Выборка.ДокументСерия), " " + СокрЛП(Выборка.ДокументСерия), "");
		Информация = Информация + ?(ЗначениеЗаполнено(Выборка.ДокументНомер), " " + СокрЛП(Выборка.ДокументНомер), "");
		Информация = Информация + ?(ЗначениеЗаполнено(Выборка.ДокументКемВыдан), " выдан " + СокрЛП(Выборка.ДокументКемВыдан), "");
		Информация = Информация + ?(ЗначениеЗаполнено(Выборка.ДокументДатаВыдачи), " " + Формат(Выборка.ДокументДатаВыдачи,"ДФ=dd.MM.yyyy"), "");
		Информация = Информация + ?(ЗначениеЗаполнено(Выборка.ДокументКодПодразделения), " код подр. " + СокрЛП(Выборка.ДокументКодПодразделения), "");
		Информация = Информация + ?(ЗначениеЗаполнено(Выборка.ДокументНачалоДействия), " действует с " + Формат(Выборка.ДокументНачалоДействия,"ДФ=dd.MM.yyyy"), "");
		Информация = Информация + ?(ЗначениеЗаполнено(Выборка.ДокументСрокДействия), " по " + Формат(Выборка.ДокументСрокДействия,"ДФ=dd.MM.yyyy"), "");
		Паспорт = Информация;
   	КонецЕсли;	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьКонтакнуюИнформациюЗалогодателя()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ЗалоговыйБилет.Дата);
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель);
    Запрос.Текст = "ВЫБРАТЬ
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения КАК ДатаРождения,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.МестоРождения КАК МестоРождения,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Гражданство КАК Гражданство,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Email КАК Email,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.АдресПоПрописке КАК АдресПоПрописке,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ФактическийАдрес КАК ФактическийАдрес,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Пол КАК Пол,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Телефон КАК Телефон,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Фамилия КАК Фамилия,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Имя КАК Имя,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Отчество КАК Отчество
                   |ИЗ
                   |	РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних(&Дата, Залогодатель = &Залогодатель) КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		КонтактнаяИнформация = "";
		КонтактнаяИнформация = КонтактнаяИнформация + ?(ЗначениеЗаполнено(Выборка.Гражданство), СокрЛП(Выборка.Гражданство), "");
		КонтактнаяИнформация = КонтактнаяИнформация + ?(ЗначениеЗаполнено(Выборка.Пол), ?(ПустаяСтрока(КонтактнаяИнформация), "", "; ") + "пол.: " + Строка(Выборка.Пол), "");
		КонтактнаяИнформация = КонтактнаяИнформация + ?(ЗначениеЗаполнено(Выборка.ДатаРождения), ?(ПустаяСтрока(КонтактнаяИнформация), "", "; ") + "дата рожд.: " +  Формат(Выборка.ДатаРождения, "ДФ=dd.MM.yyyy"), "");
		КонтактнаяИнформация = КонтактнаяИнформация + ?(ЗначениеЗаполнено(Выборка.МестоРождения), ?(ПустаяСтрока(КонтактнаяИнформация), "", "; ") + "место рожд.: " +  СокрЛП(Выборка.МестоРождения), "");
		КонтактнаяИнформация = КонтактнаяИнформация + ?(ЗначениеЗаполнено(Выборка.Телефон), ?(ПустаяСтрока(КонтактнаяИнформация), "", "; ") + "тел.: " + СокрЛП(Выборка.Телефон), "");
		КонтактнаяИнформация = КонтактнаяИнформация + ?(ЗначениеЗаполнено(Выборка.Email), ?(ПустаяСтрока(КонтактнаяИнформация), "", "; ") + "email: " + СокрЛП(Выборка.Email), "");
		Если ЗначениеЗаполнено(Выборка.АдресПоПрописке) Тогда
			АдресК = "адрес по прописке: " + СокрЛП(Выборка.АдресПоПрописке);
		Иначе  
			АдресК = "фактический адрес: " + СокрЛП(Выборка.ФактическийАдрес);
		КонецЕсли;	
		КонтактнаяИнформация = КонтактнаяИнформация + ?(ПустаяСтрока(КонтактнаяИнформация), "", "; ") + АдресК;

		ФИО = СокрЛП(Выборка.Фамилия) + " " + СокрЛП(Выборка.Имя) + ?(НЕ ПустаяСтрока(Выборка.Отчество), " " + СокрЛП(Выборка.Отчество), "");
		Гражданство = Выборка.Гражданство; 
		ДатаРождения = Выборка.ДатаРождения;
	КонецЕсли;
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьИнформациюОДокументеПредставителя()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ЗалоговыйБилет.Дата);
	Запрос.УстановитьПараметр("ДокументЗалогодателя", ДокументПредставителя);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокументаЗалогодателя КАК ВидДокументаЗалогодателя,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокумента КАК ВидДокумента,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСерия КАК ДокументСерия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНомер КАК ДокументНомер,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументДатаВыдачи КАК ДокументДатаВыдачи,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКемВыдан КАК ДокументКемВыдан,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКодПодразделения КАК ДокументКодПодразделения,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНачалоДействия КАК ДокументНачалоДействия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСрокДействия КАК ДокументСрокДействия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.Гражданство КАК Гражданство
	               |ИЗ
	               |	РегистрСведений.ЛБ_ДокументыЗалогодателей.СрезПоследних(&Дата, ДокументЗалогодателя = &ДокументЗалогодателя) КАК ЛБ_ДокументыЗалогодателейСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Информация = "";
		Информация = СокрЛП(Выборка.ВидДокумента);
		Информация = Информация + ?(ЗначениеЗаполнено(Выборка.ДокументСерия), " " + СокрЛП(Выборка.ДокументСерия), "");
		Информация = Информация + ?(ЗначениеЗаполнено(Выборка.ДокументНомер), " " + СокрЛП(Выборка.ДокументНомер), "");
		Информация = Информация + ?(ЗначениеЗаполнено(Выборка.ДокументКемВыдан), " выдан " + СокрЛП(Выборка.ДокументКемВыдан), "");
		Информация = Информация + ?(ЗначениеЗаполнено(Выборка.ДокументДатаВыдачи), " " + Формат(Выборка.ДокументДатаВыдачи,"ДФ=dd.MM.yyyy"), "");
		Информация = Информация + ?(ЗначениеЗаполнено(Выборка.ДокументКодПодразделения), " код подр. " + СокрЛП(Выборка.ДокументКодПодразделения), "");
		Информация = Информация + ?(ЗначениеЗаполнено(Выборка.ДокументНачалоДействия), " действует с " + Формат(Выборка.ДокументНачалоДействия,"ДФ=dd.MM.yyyy"), "");
		Информация = Информация + ?(ЗначениеЗаполнено(Выборка.ДокументСрокДействия), " по " + Формат(Выборка.ДокументСрокДействия,"ДФ=dd.MM.yyyy"), "");
		ПаспортПредставителя = Информация; 
	Иначе
		ПаспортПредставителя = "";
   	КонецЕсли;	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьКонтакнуюИнформациюПредставителя()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ЗалоговыйБилет.Дата);
	Запрос.УстановитьПараметр("Залогодатель", Представитель);
    Запрос.Текст = "ВЫБРАТЬ
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения КАК ДатаРождения,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.МестоРождения КАК МестоРождения,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Гражданство КАК Гражданство,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Email КАК Email,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.АдресПоПрописке КАК АдресПоПрописке,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ФактическийАдрес КАК ФактическийАдрес,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Пол КАК Пол,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Телефон КАК Телефон,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Фамилия КАК Фамилия,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Имя КАК Имя,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Отчество КАК Отчество
                   |ИЗ
                   |	РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних(&Дата, Залогодатель = &Залогодатель) КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ФамилияПредставителя = Выборка.Фамилия;
        ИмяПредставителя = Выборка.Имя;
        ОтчествоПредставителя = Выборка.Отчество;		
		ДатаРожденияПредставителя = Выборка.ДатаРождения;		
		ГражданствоПредставителя = Выборка.Гражданство;
		ПолПредставителя = Выборка.Пол;
		МестоРожденияПредставителя = Выборка.МестоРождения;
		EmailПредставителя = Выборка.Email;
		ТелефонПредставителя = Выборка.Телефон;		
		АдресПоПропискеПредставителя = Выборка.АдресПоПрописке; 
		ФактическийАдресПредставителя = Выборка.ФактическийАдрес;
		
		ФИОПредставителя = ФамилияПредставителя + " " + ИмяПредставителя + ?(ПустаяСтрока(ОтчествоПредставителя), "", " " + ОтчествоПредставителя); 
		Информация = "";
		Информация = Информация + ?(ЗначениеЗаполнено(ГражданствоПредставителя), СокрЛП(ГражданствоПредставителя), "");
		Информация = Информация + ?(ЗначениеЗаполнено(ПолПредставителя), ?(ПустаяСтрока(Информация), "", "; ") + "пол.: " + Строка(ПолПредставителя), "");
		Информация = Информация + ?(ЗначениеЗаполнено(ДатаРожденияПредставителя), ?(ПустаяСтрока(Информация), "", "; ") + "дата рожд.: " +  Формат(ДатаРожденияПредставителя, "ДФ=dd.MM.yyyy"), "");
		Информация = Информация + ?(ЗначениеЗаполнено(МестоРожденияПредставителя), ?(ПустаяСтрока(Информация), "", "; ") + "место рожд.: " +  СокрЛП(МестоРожденияПредставителя), "");
		Информация = Информация + ?(ЗначениеЗаполнено(ТелефонПредставителя), ?(ПустаяСтрока(Информация), "", "; ") + "тел.: " + СокрЛП(ТелефонПредставителя), "");
		Информация = Информация + ?(ЗначениеЗаполнено(EmailПредставителя), ?(ПустаяСтрока(Информация), "", "; ") + "email: " + СокрЛП(EmailПредставителя), ""); 
		Если ЗначениеЗаполнено(АдресПоПропискеПредставителя) Тогда
			АдресК = "адрес по прописке: " + СокрЛП(АдресПоПропискеПредставителя);
		Иначе  
			АдресК = "фактический адрес: " + СокрЛП(ФактическийАдресПредставителя);
		КонецЕсли;	
		Информация = Информация + ?(ПустаяСтрока(Информация), "", "; ") + АдресК;

		КонтактПредставителя = Информация; 
	Иначе
		КонтактПредставителя = "";
	КонецЕсли;  	
КонецПроцедуры	


&НаСервере
Процедура УстановитьВидимость()
	Если Гражданство = Справочники.СтраныМира.Россия Тогда 
		Элементы.ГруппаДопДокумент.Видимость = Ложь;
	Иначе 
		Элементы.ГруппаДопДокумент.Видимость = Истина;
	КонецЕсли;
	
	//+Мельников 28.05.24
	Если ЗначениеЗаполнено(ОтмененныйДокумент) Тогда
		Элементы.Редактировать.Доступность = Ложь;
	КонецЕсли;
	//-Мельников
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры 

&НаСервере
Функция ПроверитьКлиентаПоПеречням()
	РезультатПроверки = Истина;
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Залогодатель", Залогодатель);  
	Запрос.УстановитьПараметр("Дата", ДатаДок);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_КлиентыВПеречняхСрезПоследних.ВидПеречня КАК ВидПеречня
	               |ИЗ
	               |	РегистрСведений.ЛБ_КлиентыВПеречнях.СрезПоследних(
	               |			&Дата,
	               |			Залогодатель = &Залогодатель
	               |				И СтатусКлиентаВПеречне = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыКлиентаВПеречнях.Включен)) КАК ЛБ_КлиентыВПеречняхСрезПоследних"; 
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		Если Выборка.ВидПеречня = Перечисления.ЛБ_ВидыПеречней.Террористы Тогда
			Сообщить("Клиент найден в перечне террористов. Операции с клиентом запрещены!", СтатусСообщения.Важное);  
			РезультатПроверки = Ложь;
		ИначеЕсли Выборка.ВидПеречня = Перечисления.ЛБ_ВидыПеречней.ФРОМУ Тогда
			Сообщить("Клиент найден в перечне ФРОМУ. Операции с клиентом запрещены!", СтатусСообщения.Важное);  
			РезультатПроверки = Ложь;
        ИначеЕсли Выборка.ВидПеречня = Перечисления.ЛБ_ВидыПеречней.МВК Тогда
			Сообщить("Клиент найден в списке МВК. Операции с клиентом запрещены!", СтатусСообщения.Важное);  
			РезультатПроверки = Ложь;	
		КонецЕсли;	
	Конеццикла;
	Возврат РезультатПроверки;
КонецФункции	

&НаСервере
Функция ПроверкаКлиента() 
	ВсеОК = Истина;
	
	ВозрастКлиента = ЛБ_ОбщийМодуль.ВычислитьВозраст(ДатаРождения);
	Если ВозрастКлиента  < 18 Тогда
	    Сообщить("Клиенту " + Строка(ВозрастКлиента) + " лет, работа с несовершеннолетними клиентами не осуществляется!", СтатусСообщения.Важное);
		ВсеОК = ложь;
	КонецЕсли;	
	
	Если НЕ ПроверитьКлиентаПоПеречням() Тогда
		ВсеОК = ложь;
	КонецЕсли; 
			
	Возврат ВсеОК;
КонецФункции    

&НаКлиенте
Процедура История(Команда)
	Если ЗначениеЗаполнено(ЗалоговыйБилет) Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Клиент", ПолучитьЗалогодателя());
		ПараметрыФормы.Вставить("ЗалоговыйБилет", ЗалоговыйБилет);	 
								
		ОткрытьФорму("Отчет.ЛБ_ИсторияЗалоговогоБилета.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;	
КонецПроцедуры

&НаСервере
// Проверяет заполнение полей залогового билета
//
// Параметры
//  Нет
//
// Возвращаемое значение
//  Булево - результат проверки
//
Функция ПроверкаЗаполнения()
	
	Результат = Истина;       
	//Если НЕ ЗначениеЗаполнено(Ломбард) тогда
	//	Результат = Ложь;
	//	Сообщить("Не выбран ломбард!",СтатусСообщения.Внимание);
	//КонецЕсли; 
	//
	//Если НЕ ЗначениеЗаполнено(Фамилия) тогда
	//	Результат = Ложь;
	//	Сообщить("Не заполнена фамилия клиента!",СтатусСообщения.Внимание);
	//КонецЕсли;  
	//
	//Если НЕ ЗначениеЗаполнено(Имя) тогда
	//	Результат = Ложь;
	//	Сообщить("Не заполнено имя клиента!",СтатусСообщения.Внимание);
	//КонецЕсли;  
	//
	//Если НЕ ЗначениеЗаполнено(ДатаРождения) тогда
	//	Результат = Ложь;
	//	Сообщить("Не заполнена дата рождения клиента!",СтатусСообщения.Внимание);
	//КонецЕсли;
	//
	//Если НЕ ЗначениеЗаполнено(Гражданство) тогда
	//	Результат = Ложь;
	//	Сообщить("Не выбрано гражданство клиента!",СтатусСообщения.Внимание);
	//КонецЕсли;
	//
	//Если НЕ ЗначениеЗаполнено(СхемаКредитования) тогда
	//	Результат = Ложь;
	//	Сообщить("Не выбрана схема кредитования!",СтатусСообщения.Внимание);
	//КонецЕсли;    
	//
	//Если ПроцентныеСтавкиПоПериодам.Количество() = 0 Тогда
	//	Результат = Ложь;
	//	Сообщить("Не определены процентные ставки!",СтатусСообщения.Внимание);
	//КонецЕсли;  

	//Если НЕ ТаблицаТоваров.Количество() Тогда		
	//	Результат = Ложь;
	//	Сообщить("Состав залога не указан!",СтатусСообщения.Внимание);		
	//КонецЕсли;    
	//
	//Если Не Результат Тогда
	//	возврат Результат;
	//КонецЕсли;	
	//
	//Если Результат Тогда
	//	Если ДокументВид = Справочники.ВидыДокументовФизическихЛиц.ПаспортРФ Тогда
	//		Если ПустаяСтрока(ДокументКодПодразделения) Тогда
	//			Сообщить("Для документ удостоверяющего личность залогодателя необходимо заполнить код подразделения!");
	//			Результат = ложь;
	//		КонецЕсли;	
	//		Если ПустаяСтрока(ДокументКемВыдан) Тогда
	//			Сообщить("Для документ удостоверяющего личность залогодателя необходимо заполнить кем выдан!");
	//			Результат = ложь;
	//		КонецЕсли;	
	//	КонецЕсли;
	//	Если ((ДокументВид = Справочники.ВидыДокументовФизическихЛиц.ПаспортРФ) ИЛИ 
	//	(ДокументВид = Справочники.ВидыДокументовФизическихЛиц.ВидНаЖительство И ДокументВидДокументаЗалогодателя = Перечисления.ЛБ_ВидыДокументовЗалогодателя.ДокументУдостоверяющийЛичность)) Тогда
	//	    Если ДокументВид = Справочники.ВидыДокументовФизическихЛиц.ПаспортРФ Тогда 			    
	//			Парам = Новый Структура("Серия, Номер", СокрЛП(ДокументСерия), СокрЛП(ДокументНомер));
	//			Если ЛБ_ОбменLX.ПаспортНедействителен(Парам) Тогда 
	//				Если ЗначениеЗаполнено(ДокументЗайма) Тогда
	//					Сообщить("Документ найден в списке недействительных паспортов!");
	//				    Результат = ложь; 
	//				КонецЕсли;	
	//			ИначеЕсли НЕ ЛБ_ОбщийМодуль.ПроверитьПаспортРФДействует(ДатаРождения, ДокументДатаВыдачи) Тогда
	//				Сообщить("Документ удостоверяющий личность залогодателя просрочен!");
	//			    Результат = ложь;	
	//			КонецЕсли;	
	//		ИначеЕсли НЕ ЛБ_ОбщийМодуль.ПроверитьПаспортРФДействует(ДатаРождения, ДокументДатаВыдачи) Тогда
	//			Сообщить("Документ удостоверяющий личность залогодателя просрочен!");
	//		    Результат = ложь;   
	//		КонецЕсли;	
	//	ИначеЕсли (ДокументВид = Справочники.ВидыДокументовФизическихЛиц.СвидетельствоОРождении) И НЕ ЛБ_ОбщийМодуль.ПроверитьСвидетельствоОРожденииДействует(ДатаРождения) Тогда
	//		Сообщить("Документ удостоверяющий личность залогодателя просрочен!");
	//	    Результат = ложь;
	//	КонецЕсли;	
	//	Если ЛБ_ОбщийМодуль.ДокументСоСрокомДействия(ДокументВидДокументаЗалогодателя, ДокументВид) тогда
	//		Если НЕ ЗначениеЗаполнено(ДокументСрокДействия) Тогда
	//			Сообщить("Для документ удостоверяющего личность залогодателя необходимо заполнить срок действия!");
	//	        Результат = ложь;
	//		ИначеЕсли ДокументСрокДействия < НачалоДня(ДатаДок) Тогда
	//			Сообщить("Документ удостоверяющий личность залогодателя просрочен!");
	//	        Результат = ложь;
	//		КонецЕсли;	
	//	КонецЕсли;	 
	//	Если НЕ Гражданство = Справочники.СтраныМира.Россия Тогда
	//		Отбор = Новый Структура; 
	//		Отбор.Вставить("Клиент", Залогодатель);
	//		Строки = ДопДокументы.НайтиСтроки(Отбор);
	//		Если Строки.Количество() = 0 Тогда 
	//			Сообщить("Не выбран документ удостоверяющий право пребывания клиента на территории РФ!");
	//	        Результат = ложь;
	//		Иначе                  
	//			ЕстьДокументГражданствоНЕРФ = ложь;
	//			Для каждого Стр Из Строки Цикл
	////				Если ЛБ_ОбщийМодуль.ДокументСоСрокомДействия(Стр.ДокументЗалогодателя, Стр.ВидДокумента) тогда 
	////					Если НЕ ЗначениеЗаполнено(ДокументСрокДействия) Тогда
	////						Продолжить;
	////					ИначеЕсли ДокументСрокДействия <	НачалоДня(ДатаДок) Тогда
	////						Продолжить;
	////					КонецЕсли;	
	////                    ГражданствоНЕРФ = Истина;
	////					Прервать;  
	////				Иначе
	////					ГражданствоНЕРФ = Истина;
	////					Прервать; 
	////				КонецЕсли;	
					//Если Стр.ДокументГражданство = Гражданство Тогда
					//	ЕстьДокументГражданствоНЕРФ = Истина;
					//	Прервать; 
					//КонецЕсли;	
	//			КонецЦикла;	
	//			Если НЕ ГражданствоНЕРФ Тогда
	//				Сообщить("У клиента нет действующего документа, удостоверяющего право пребывания на территории РФ!");
	//				Результат = ложь;
	//			КонецЕсли;	
	//		КонецЕсли;	
	//	КонецЕсли;	  
	//КонецЕсли;
	//
	//Если Результат Тогда  
	//	
	//
	//	
	//	Для каждого СтрокаТабличнойЧасти Из Товары Цикл
	//		
	//		Результат = Результат 
	//		И ЗначениеЗаполнено(СтрокаТабличнойЧасти.ВидИзделия)
	//		И ЗначениеЗаполнено(СтрокаТабличнойЧасти.Проба)
	//		И ЗначениеЗаполнено(СтрокаТабличнойЧасти.Описание)
	//		И ЗначениеЗаполнено(СтрокаТабличнойЧасти.Количество)
	//		И ЗначениеЗаполнено(СтрокаТабличнойЧасти.Цена)
	//		И ЗначениеЗаполнено(СтрокаТабличнойЧасти.СуммаОценки)
	//		И ЗначениеЗаполнено(СтрокаТабличнойЧасти.СуммаСсуды); 
	//		
	//		Если НЕ Результат Тогда
	//		    Сообщить("В строке № " + СтрокаТабличнойЧасти.НомерСтроки +  " не заполнены обязательные поля", СтатусСообщения.Внимание);
	//            Результат = ложь;
	//			Прервать;
	//		КонецЕсли;	   
	//		
	//			
	//		Если СтрокаТабличнойЧасти.ЕстьДопМеталлы И НЕ СтрокаТабличнойЧасти.ЕстьЭтикетка Тогда   
	//			Сообщить("В строке № " + Строка(СтрокаТабличнойЧасти.НомерСтроки) + " есть дополнительные металлы, но нет этикетки!");
	//	        Результат = ложь;		
	//		КонецЕсли;
	//					
	//		Если СтрокаТабличнойЧасти.Именник = Перечисления.ЛБ_Именник.Да тогда
	//			Если ПустаяСтрока(СтрокаТабличнойЧасти.ДанныеИменника) Тогда
	//				Сообщить("Если именник РФ, то необходимо заполнить данные именника.");
	//				Результат = ложь;
	//			КонецЕсли;	
	//		КонецЕсли;  
	//		
	//		Если СтрокаТабличнойЧасти.ЕстьДеффекты тогда
	//			Если ПустаяСтрока(СтрокаТабличнойЧасти.Дефекты) Тогда
	//				Сообщить("Если в изделии есть дефекты, то необходимо их описать.");
	//				Результат = ложь;
	//			КонецЕсли;	
	//		КонецЕсли;  
	//		
	//					
	//		Если НЕ Результат Тогда
	//			
	//			Прервать;
	//			
	//		КонецЕсли; 
	//		
	//	КонецЦикла; 
	//	
	//КонецЕсли;
				
	Возврат Результат;
	
КонецФункции // ПроверкаЗаполнения() 

&НаСервере
Функция СоздатьДокументНаСервере()  
	Если ЗначениеЗаполнено(ДокументЗайма) Тогда
		ДокументОбъект = ДокументЗайма.ПолучитьОбъект(); 
		Если ДокументОбъект.ПометкаУдаления Тогда
		    ДокументОбъект.УстановитьПометкуУдаления(Ложь); 
		КонецЕсли; 
	Иначе	       
		//ЗБ = ЗалоговыйБилет;
	    ДокументОбъект = Документы.ЛБ_ОперацияПоЗалогу.СоздатьДокумент(); 
		ДокументОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОтменаПереоформления; 
	КонецЕсли;

	ДокументОбъект.Дата = ДатаДок;	
	ДокументОбъект.ОтветственныйПользователь = ОтветственныйПользователь;
	ДокументОбъект.ОтветственныйСотрудник = ОтветственныйСотрудник;
	ДокументОбъект.Ломбард = Ломбард;     
	ДокументОбъект.ПредыдущаяОперация = ЗалоговыйБилет;
	ДокументОбъект.Организация = ЗалоговыйБилет.Организация; 
	ДокументОбъект.Залогодатель = ЗалоговыйБилет.Залогодатель; 
	ДокументОбъект.НомерЗалоговогоБилета = ЗалоговыйБилет.НомерЗалоговогоБилета;
	ДокументОбъект.Комментарий = Комментарий;  
	
	ДокументОбъект.ТоварыОтмена.Очистить();
	Для каждого стр Из ТаблицаТоваров Цикл
		СтрТ = ДокументОбъект.ТоварыОтмена.Добавить();
		СтрТ.ОбъектЗалога = Стр.ОбъектЗалога;
		СтрТ.СуммаОценки = Стр.СуммаОценки;
		СтрТ.Статус = Стр.СтатусОбъекта;
	КонецЦикла;
	
	//+Мельников 25.04.24 Отмена операции
	ДокументОбъект.ОтмененныйДокумент = ЗалоговыйБилет;
	//-Мельников

	ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
	Попытка           			 
	    ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);

		////+Мельников 25.04.24 Установка отментки об отмене документа в отменяемом документе
		//ДокументОтмены = ДокументОбъект.Ссылка;
		//
		//ОтменяемыйДокумент = ЗалоговыйБилет.ПолучитьОбъект();
		//ОтменяемыйДокумент.ДокументОтмены = ДокументОтмены;

		//ОтменяемыйДокумент.Записать(РежимЗаписиДокумента.Запись);

		//Попытка           
		//	ОтменяемыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
		//Исключение
		//	ОбщегоНазначения.СообщитьПользователю("Не удалось установить отметку в отменяемом документе");
		//КонецПопытки;
		////-Мельников
	Исключение   
		ОбщегоНазначения.СообщитьПользователю("Не удалось провести документ " + строка(ДокументОбъект.Ссылка));
	КонецПопытки; 
	Возврат ДокументОбъект.Ссылка;	
КонецФункции	

&НаСервере
Функция ОтменитьВыдачуЗаймаНаСервере() 
	СообщениеПроверкиПоЛомбарду = ЛБ_УправлениеЛомбардом.ПроверитьИзделияЗБВЛомбарде(ЗалоговыйБилет.Дата-1, ПредыдущаяОперация, Ломбард, ложь); 
	Если НЕ ПустаяСтрока(СообщениеПроверкиПоЛомбарду) Тогда 
		ОбщегоНазначения.СообщитьПользователю(СообщениеПроверкиПоЛомбарду + ". Отмена переоформления запрещена.");
		Возврат Ложь;
	КонецЕсли;   
    	
	ЕстьНеПроведенные = Ложь;   
	СсылкаНаДокумент = СоздатьДокументНаСервере();   
	Если НЕ СсылкаНаДокумент.проведен Тогда 
		ЕстьНеПроведенные = истина;
	//+Мельников 31.07.24 Правка для Отмены операции
	Иначе
		ДокументОтмены = СсылкаНаДокумент;
	//-Мельников
	КонецЕсли;	
	
	Возврат ЕстьНеПроведенные;
КонецФункции

&НаСервере
Функция ПолучитьПредыдущегоЗалогодателя()
	Возврат ПредыдущаяОперация.Залогодатель;
КонецФункции

&НаКлиенте
Процедура ОтменитьВыдачуЗайма(Команда)
	Если НеРедактировать Тогда
		Возврат;
	КонецЕсли;
	
	ЕстьНеПроведенные = ОтменитьВыдачуЗаймаНаСервере();
		
	Если НЕ ЕстьНеПроведенные Тогда
		НеРедактировать = Истина;
		Элементы.ДекорацияСтатусДокумента.Заголовок = "Факт"; 
		Элементы.ДекорацияСтатусДокумента.ЦветТекста = WebЦвета.ТемноБордовый;  
		Элементы.ДекорацияСтатусДокумента.ЦветФона = WebЦвета.ТусклоРозовый;
        Элементы.Редактировать.Видимость = Истина; 
		Элементы.ОтменитьЗайм.Доступность = Ложь;
	   	Элементы.ОсновнаяПанель.ТолькоПросмотр = НеРедактировать; 
		
		Если ВладелецФормы.ИмяФормы = "ОбщаяФорма.ЛБ_РабочееМестоПриемщикаЛомбарда" Тогда
   	        ФормаРМП = ВладелецФормы;   
			Если ФормаРМП.Залогодатель = ПолучитьПредыдущегоЗалогодателя() Тогда
                ФормаРМП.ПослеВыбораТекущееСостояниеЗБ(Истина, неопределено);
			ИначеЕсли ФормаРМП.Залогодатель = Залогодатель Тогда
                ФормаРМП.ПослеВыбораТекущееСостояниеЗБ(Истина, неопределено);
			КонецЕсли;	
        КонецЕсли;
	КонецЕсли;	

	//+Мельников 28.05.24
	УстановитьВидимость()
	//-Мельников

КонецПроцедуры

&НаСервере
Функция СнятьСПроведения(Документ)  
	ДокОбъект = Документ.ПолучитьОбъект(); 
	Если ДокОбъект.Проведен Тогда                  
		Попытка
		    ДокОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);  
			Возврат Истина;
		Исключение   
			Сообщить("Не удалось снять с проведения залоговый билет " + СокрЛП(Документ.НомерЗалоговогоБилета) + ". Редактирование запрещено.");
			Возврат Ложь;
		КонецПопытки;	
	Иначе
		возврат Истина;
	КонецЕсли;
КонецФункции	

&НаКлиенте
Процедура Редактировать(Команда)   
	ПроверкаМожноРедактировать = Истина;
	Если ЭтаФорма.НеРедактировать Тогда 
		Если ЗначениеЗаполнено(ДокументЗайма) тогда 
			Результат = СнятьСПроведения(ДокументЗайма);
			Если НЕ Результат тогда  
				ПроверкаМожноРедактировать = Ложь;
			КонецЕсли;	
		КонецЕсли;	
		Если ПроверкаМожноРедактировать Тогда  
			НеРедактировать = Ложь;
			Этаформа.ТолькоПросмотр = Ложь;
			Этаформа.Открыть();
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	Элементы.ОсновнаяПанель.ТолькоПросмотр = НеРедактировать; 
	Элементы.СтраницаЗаемщик.ТолькоПросмотр = Истина;  
	Элементы.ДекорацияСтатусДокумента.Заголовок = "Проект"; 
	Элементы.ДекорацияСтатусДокумента.ЦветТекста = WebЦвета.ТемноЗеленый;
	Элементы.ДекорацияСтатусДокумента.ЦветФона = WebЦвета.СветлоЗеленый;
	Элементы.Редактировать.Видимость = Ложь; 
	Элементы.ОтменитьЗайм.Доступность = Истина;
КонецПроцедуры

&НаСервере
Функция МакетПечатнойФормы(ШаблонДокумента)
	
	Если НЕ ТипЗнч(ШаблонДокумента.ХранилищеШаблона.Получить()) = Тип("ДвоичныеДанные") Тогда
		Сообщить("Шаблон печати анкеты не загружен!");
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ШаблонДокумента.ХранилищеШаблона.Получить();
	 
КонецФункции 

&НаКлиенте
Процедура ПечатьЗалоговыйБилет(Команда)
	ШаблонДокумента = ПредопределенноеЗначение("Справочник.ЛБ_ШаблоныПечатиДокументов.ЗалоговыйБилет");
	ДвоичныеДанные = МакетПечатнойФормы(ШаблонДокумента);	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("doc"); 
	
	Если ДвоичныеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Попытка
		ДвоичныеДанные.Записать(ИмяВременногоФайла);
		Word = Новый COMОбъект("Word.Application");
		//Word.Documents.Open(ИмяВременногоФайла);   
		Word.Documents.add(ИмяВременногоФайла);
	    ActiveDocument = Word.Application.Documents(1);
	    ActiveDocument.Activate();
	Исключение
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не удалось создать документ Word. " + ОписаниеОшибки());							
		Word = Неопределено;
		Возврат;
	КонецПопытки;
	
	//ПаспортныеДанныеСтруктура = ПаспортныеДанныеКлиента();
	//
	//ActiveDocument = Word.ActiveDocument;
	//ВывестиПараметрНаПечать(ActiveDocument, "ТекДата",              Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy"));
	//ВывестиПараметрНаПечать(ActiveDocument, "ФИО",                  СокрЛП(Фамилия) + " " + СокрЛП(Имя) + ?(НЕ ПустаяСтрока(Отчество), " " + СокрЛП(Отчество), ""));
	//ВывестиПараметрНаПечать(ActiveDocument, "ДатаРождения",         Формат(ДатаРождения, "ДФ=dd.MM.yyyy"));
	//ВывестиПараметрНаПечать(ActiveDocument, "ПаспортныеДанные",     ПаспортныеДанныеСтруктура.ПаспортныеДанные);
	//ВывестиПараметрНаПечать(ActiveDocument, "АдресМестаЖительства", ?(Не ПустаяСтрока(АдресПоПрописке), АдресПоПрописке, ФактическийАдрес)); 
	//ВывестиПараметрНаПечать(ActiveDocument, "Согласен",             ?(Пол = ПредопределенноеЗначение("Перечисление.ПолФизическогоЛица.Женский"), "согласна", "согласен"));
	
	Word.Visible = Истина;
	Word.WindowState = 2;
	Word.WindowState = 1;
КонецПроцедуры  

&НаКлиенте
Процедура Вперед(Команда)
	Если Элементы.ОсновнаяПанель.ТекущаяСтраница = Элементы.СтраницаЗаемщик тогда 
		Элементы.ОсновнаяПанель.ТекущаяСтраница = Элементы.СтраницаОбъектыЗалога;  
	ИначеЕсли Элементы.ОсновнаяПанель.ТекущаяСтраница = Элементы.СтраницаОбъектыЗалога тогда
		Элементы.ОсновнаяПанель.ТекущаяСтраница = Элементы.СтраницаДополнительно;	
	конецЕсли;	  
	ПриСменеСтраницы(Элементы.ОсновнаяПанель.ТекущаяСтраница);
КонецПроцедуры

&НаКлиенте
Процедура Назад(Команда)
	Если Элементы.ОсновнаяПанель.ТекущаяСтраница = Элементы.СтраницаДополнительно тогда 
		Элементы.ОсновнаяПанель.ТекущаяСтраница = Элементы.СтраницаОбъектыЗалога; 
	ИначеЕсли Элементы.ОсновнаяПанель.ТекущаяСтраница = Элементы.СтраницаОбъектыЗалога тогда
		Элементы.ОсновнаяПанель.ТекущаяСтраница = Элементы.СтраницаЗаемщик;
	конецЕсли;	  
	ПриСменеСтраницы(Элементы.ОсновнаяПанель.ТекущаяСтраница);
КонецПроцедуры

&НаКлиенте
Процедура ПриСменеСтраницы(ТекущаяСтраница)
    Если ТекущаяСтраница = Элементы.СтраницаЗаемщик Тогда 
		Элементы.Вперед.Доступность = Истина; 
		Элементы.Назад.Доступность = Ложь;
	ИначеЕсли ТекущаяСтраница = Элементы.СтраницаОбъектыЗалога Тогда 
		Элементы.Вперед.Доступность = Истина; 
		Элементы.Назад.Доступность = Истина;
	ИначеЕсли ТекущаяСтраница = Элементы.СтраницаДополнительно Тогда 
		Элементы.Вперед.Доступность = Ложь; 
		Элементы.Назад.Доступность = Истина;
	КонецЕсли;

КонецПроцедуры	

&НаКлиенте
Процедура ОсновнаяПанельПриСменеСтраницы(Элемент, ТекущаяСтраница)
	ПриСменеСтраницы(ТекущаяСтраница);
КонецПроцедуры

&НаКлиенте
Процедура ДатаДокПриИзменении(Элемент)
	Если ДатаДок < ЗалоговыйБилет.Дата Тогда		
		Предупреждение("Дата текущей операции не может быть меньше даты залогового билета.", 60);
	    ДатаДок = ТекДатаДок;
    Иначе
		Часы = (ДатаДок - ЗалоговыйБилет.Дата)/3600;   
		Если Часы > 1 Тогда 
		   Предупреждение("Отмена залогового билета со времени выдачи которого прошло больше 1 часа невозможна.", 60); 
		   ДатаДок = ТекДатаДок;
	    КонецЕсли; 
	КонецЕсли;   
КонецПроцедуры

&НаКлиенте
Процедура ДатаДокНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ТекДатаДок = ДатаДок;
КонецПроцедуры

&НаСервере
Функция ПолучитьЗалогодателя()
	Возврат  ЗалоговыйБилет.Залогодатель;
КонецФункции

&НаКлиенте
Процедура СтатистикаПоКлиенту(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Клиент", ПолучитьЗалогодателя());
	ПараметрыФормы.Вставить("Дата", ДатаДок);	 
							
	ОткрытьФорму("Отчет.ЛБ_СтатистикаОбращенийКлиента.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаСервере
Функция ПолучитьНачальногоЗаемщика()
	Возврат ПредыдущаяОперация.Залогодатель
КонецФункции	

&НаКлиенте
Процедура ДекорацияЗБПереоформлениеНажатие(Элемент)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Клиент", ПолучитьНачальногоЗаемщика());
	ПараметрыФормы.Вставить("ЗалоговыйБилет", ПредыдущаяОперация);	 
							
	ОткрытьФорму("Отчет.ЛБ_ИсторияЗалоговогоБилета.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЗБНажатие(Элемент)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Документ", ЗалоговыйБилет);	 
							
	ОткрытьФорму("ОбщаяФорма.ЛБ_ФормаПереоформленияЗайма", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры
